{
  "backend/main.mo": "Motoko backend defining label settings, user profiles, and print job submission with authorization checks and serial-duplication prevention.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, titles, affected files, components, and test IDs for recent UI and printing changes.",
  "frontend-file-summaries.txt": "Text document summarizing key frontend source files and their responsibilities.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme CSS variables and base styles.",
  "frontend/index.html": "HTML entry point that loads the React app root and main module.",
  "frontend/src/App.tsx": "App root wiring password session, error boundary handling, and conditional lock screen vs. main shell rendering.",
  "frontend/src/audio/soundSystem.ts": "Zustand-powered sound settings store with custom sound management and Web Audio playback utilities.",
  "frontend/src/auth/passwordSession.ts": "LocalStorage-backed password session utilities with expiry, credential checks, and password validation.",
  "frontend/src/auth/PasswordSessionProvider.tsx": "React context managing password sessions with unlock/lock logic and session hydration validation.",
  "frontend/src/components/AppShell.tsx": "Main application layout with header, footer, and tabbed navigation for scan, settings, devices, and diagnostics pages.",
  "frontend/src/components/BackendAvailabilityIndicator.tsx": "Shows a destructive badge when the backend is unavailable based on backend availability state.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a fallback UI and reload option when a component throws.",
  "frontend/src/components/HeaderDeviceControls.tsx": "Displays printer connection status and an optional screen wake-lock toggle.",
  "frontend/src/components/SerialTypeCounters.tsx": "Renders counters for label print types based on diagnostics data and configured prefix mappings.",
  "frontend/src/components/SoundEffectsSettings.tsx": "UI for selecting, testing, uploading, and managing built‑in or custom sound effects per event type.",
  "frontend/src/config/lockScreenConfig.ts": "Provides the expected lock screen password, using an environment variable override if set.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for submitting print jobs, fetching print history, and increasing print counts with backend availability handling.",
  "frontend/src/hooks/useWakeLock.ts": "React hook managing screen wake lock support, activation, persistence, and visibility-based re-requesting.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, dark mode, focus states, and touch-friendly sizing.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global CSS.",
  "frontend/src/printing/barcodePreview.ts": "Generates simple deterministic SVG barcodes using custom pattern logic as a jsbarcode alternative.",
  "frontend/src/printing/cpclBarcodeDiagnostics.ts": "Utilities validating barcode data, position, and height while logging warnings and errors.",
  "frontend/src/printing/cpclBarcodeMapping.ts": "Provides CPCL barcode type mappings, fallback handling, and supported-type lookup utilities.",
  "frontend/src/printing/cpclGenerator.ts": "Builds CPCL label commands, performing validation, barcode sizing, logging, and fallback handling.",
  "frontend/src/printing/cpclLayoutAdjustments.ts": "Functions estimating barcode width and adjusting or clamping X positions to prevent clipping.",
  "frontend/src/printing/LabelPreview.tsx": "Component rendering an interactive label preview with zoom, barcode generation, and layout calculations.",
  "frontend/src/screens/LockScreen.tsx": "Password lock screen that validates input, triggers session unlock, and handles error and loading states.",
  "frontend/src/screens/PasswordSessionWiringErrorScreen.tsx": "Displays a configuration error message with guidance and a refresh button when the password session system is misconfigured.",
  "frontend/src/services/printerService.ts": "Zustand store managing USB printer connection, CPCL sending, test prints, and logging.",
  "frontend/src/services/usbCpclTransport.ts": "WebUSB utilities for discovering, connecting to, and communicating with CPCL-compatible USB printers.",
  "frontend/src/state/backendAvailabilityStore.ts": "Zustand store tracking backend availability, last errors, and timestamps.",
  "frontend/src/state/diagnosticsStore.ts": "Persistent diagnostics store tracking scan/print counts and per-type counters.",
  "frontend/src/state/labelSettingsStore.ts": "Persistent store for label layout settings with BigInt-safe storage, defaults, and migration from older formats.",
  "frontend/src/state/logStore.ts": "Persistent log store keeping up to 1000 structured log entries with metadata.",
  "frontend/src/state/printHistoryStore.ts": "Stores print history and provides reprint functionality using the printer service.",
  "frontend/src/state/useLabelSettingsHydration.ts": "Hook that reports when label settings have finished hydration from localStorage.",
  "frontend/src/tabs/DevicesTab.tsx": "Provides UI and logic for connecting, disconnecting, and test-printing with a USB CPCL printer using WebUSB.",
  "frontend/src/tabs/DiagnosticsTab.tsx": "Displays scan/print statistics, print history with reprint functionality, and filtered logs for diagnostics.",
  "frontend/src/tabs/LabelSettingsTab.tsx": "Manages label configuration, layout editing, prefix mappings, import/export, previewing, and test printing of label settings.",
  "frontend/src/tabs/ScanPrintTab.tsx": "Handles serial scanning, validation, label type detection, CPCL generation, backend submission, and printing workflow.",
  "frontend/src/utils/barcodeSettingsValidation.ts": "Validates barcode types and layout settings to ensure CPCL barcodes have valid scale and printable dimensions.",
  "frontend/src/utils/icErrors.ts": "Detects Internet Computer canister-stopped errors and formats IC rejection errors into user-friendly messages.",
  "frontend/src/utils/labelSettingsErrors.ts": "Parses label settings update errors into clearer messages, including admin, network, prefix, and canister-stopped cases.",
  "frontend/src/utils/labelSettingsImportExport.ts": "Handles exporting label settings with BigInt serialization and importing with migration from old formats plus validation.",
  "frontend/src/utils/labelTypes.ts": "Defines built‑in and custom label types and utilities for naming, extracting, and listing them.",
  "frontend/src/utils/scanPrintErrors.ts": "Formats backend and printer errors into concise messages and detects non‑blocking backend conditions.",
  "frontend/src/utils/serialNormalization.ts": "Normalizes scanned serials by trimming whitespace and removing scanner suffix characters.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters in browser routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, current features, and pending requests for the test‑label feature."
}