{
  "backend/main.mo": "Motoko canister implementing user auth, print job submission with serial tracking, and per-user label settings using maps and access control.",
  "feature_evidence.json": "Empty feature evidence report stub.",
  "frontend-file-summaries.txt": "Prewritten summaries for all major frontend files.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "App bootstrap wiring password session provider, error boundary, and lock screen vs main shell rendering.",
  "frontend/src/audio/soundSystem.ts": "Zustand‑based sound settings store plus Web Audio beep and sequence playback utilities.",
  "frontend/src/auth/passwordSession.ts": "LocalStorage‑persisted password session creation, validation, expiry checks, and expected password comparison.",
  "frontend/src/auth/PasswordSessionProvider.tsx": "Context provider managing password session lifecycle with unlock/lock and validation against expected password.",
  "frontend/src/components/AppShell.tsx": "Main UI shell with header, lock button, tab navigation, and routed tab content for core features.",
  "frontend/src/components/BackendAvailabilityIndicator.tsx": "Shows a destructive badge when the backend is unavailable using store state.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that logs errors and displays a fallback UI or custom fallback component.",
  "frontend/src/components/HeaderDeviceControls.tsx": "Displays printer connection status and a wake‑lock toggle if supported.",
  "frontend/src/components/SerialTypeCounters.tsx": "Renders print counters per prefix mapping with loading and empty states.",
  "frontend/src/config/lockScreenConfig.ts": "Provides lock‑screen password logic with environment override.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, stored identity loading, and context management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for submitting print jobs, fetching history, and increasing counts with backend availability handling.",
  "frontend/src/hooks/useWakeLock.ts": "Manages screen wake‑lock state with persistence and visibility re‑request logic.",
  "frontend/src/index.css": "Tailwind base styles with a dark warehouse theme, accessibility settings, and component defaults.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/printing/barcodePreview.ts": "Creates a simple deterministic barcode SVG by converting characters into bar patterns and assembling them into an SVG string.",
  "frontend/src/printing/cpclGenerator.ts": "Builds CPCL command strings for test prints and customizable labels using layout settings and serial data.",
  "frontend/src/printing/LabelPreview.tsx": "Interactive label preview with zoom, sample serial inputs, layout conversion, and barcode rendering.",
  "frontend/src/screens/LockScreen.tsx": "Provides a password-based lock screen UI that validates input, shows errors, and triggers session unlock.",
  "frontend/src/screens/PasswordSessionWiringErrorScreen.tsx": "Displays an error screen explaining misconfiguration of the password session system with refresh guidance.",
  "frontend/src/services/printerService.ts": "Manages printer connection state, USB/Bluetooth setup, CPCL sending, and test prints via a Zustand store.",
  "frontend/src/services/usbCpclTransport.ts": "Implements WebUSB-based discovery, connection, and data transfer for CPCL-compatible USB printers.",
  "frontend/src/state/backendAvailabilityStore.ts": "Tracks backend availability, success/error timestamps, and provides actions to update or reset the state.",
  "frontend/src/state/diagnosticsStore.ts": "Maintains scan/print/error counters and per-type statistics with persistent storage through Zustand.",
  "frontend/src/state/labelSettingsStore.ts": "Zustand store managing label settings with BigInt‑safe persistence, default layouts, and migration from older formats.",
  "frontend/src/state/logStore.ts": "Zustand‑based persistent log store that records timestamped log entries and keeps the latest 500.",
  "frontend/src/state/printHistoryStore.ts": "Persistent print history store with reprint support using saved CPCL and logging of outcomes.",
  "frontend/src/tabs/DevicesTab.tsx": "UI tab for connecting to printers via Bluetooth or USB, showing connection status and allowing test prints.",
  "frontend/src/tabs/DiagnosticsTab.tsx": "Diagnostics interface displaying stats, print history with reprint, logs, and sound settings.",
  "frontend/src/tabs/LabelSettingsTab.tsx": "Editor UI for label configuration including dimensions, prefix mappings, element layout, and import/export.",
  "frontend/src/tabs/ScanPrintTab.tsx": "Scan-and-print workflow handling serial validation, prefix detection, CPCL generation, printing, and diagnostics updates.",
  "frontend/src/utils/icErrors.ts": "Helpers to detect and describe IC0508 'canister is stopped' errors from Internet Computer operations.",
  "frontend/src/utils/labelSettingsErrors.ts": "Provides a parser that converts raw label settings update errors into user-friendly messages, handling canister, auth, network, duplicate, and prefix errors.",
  "frontend/src/utils/labelSettingsImportExport.ts": "Handles exporting label settings with BigInt-safe JSON and importing/migrating old or new formats with validations and layout generation.",
  "frontend/src/utils/labelTypes.ts": "Defines built-in label types and utilities for deriving display names, extracting custom types, and producing a merged sorted list of all label types.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with sessionStorage support and hash-based routing handling.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Describes project state, architecture, issues, and features for the barcode and label printing system."
}