{
  "backend/main.mo": "Motoko backend actor managing print jobs, user profiles, label settings, and authorization with access control mixins; includes types for label layout, print jobs, and CPCL configuration with prefix mappings.",
  "feature_evidence.json": "Feature evidence report documenting four CPCL barcode generation and positioning calibration features targeting cpclLayoutAdjustments.ts and LabelPreview.tsx to fix barcode fitting and preview accuracy issues.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files covering authentication, printing workflow, label settings with calibration offsets, device management, diagnostics, and state stores.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI elements including sidebar, charts, and semantic tokens.",
  "frontend/index.html": "HTML entry point for the Make Some Double barcode and label printing system with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component wrapping the app with ErrorBoundary and PasswordSessionProvider, conditionally rendering LockScreen or AppShell based on session lock state.",
  "frontend/src/audio/soundSystem.ts": "Zustand store managing sound settings (success/error/print complete) with custom sound upload support, volume control, and Web Audio API beep generation plus custom audio playback functions.",
  "frontend/src/auth/passwordSession.ts": "Password session utilities with localStorage persistence, 8-hour expiry, and validation functions that check credentials against configured expected password from lockScreenConfig.",
  "frontend/src/auth/PasswordSessionProvider.tsx": "React context provider managing password session state with unlock/lock methods, session rehydration on mount, and validation against configured expected password.",
  "frontend/src/components/AppShell.tsx": "Main application shell component that renders the header with logo, device controls, and lock button, plus a tabbed interface for Scan & Print, Label Settings, Devices, and Diagnostics tabs.",
  "frontend/src/components/BackendAvailabilityIndicator.tsx": "Displays a red badge with \"Backend Unavailable\" message when the backend is not available; hidden when backend is reachable.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches errors in child components and displays a fallback UI with a refresh button.",
  "frontend/src/components/HeaderDeviceControls.tsx": "Header component displaying printer connection status badge and a wake lock toggle switch to keep the screen awake.",
  "frontend/src/components/SerialTypeCounters.tsx": "Displays print count statistics grouped by prefix mappings configured in label settings; shows empty state if no mappings exist.",
  "frontend/src/components/SoundEffectsSettings.tsx": "Component for configuring sound effects for success, error, and print complete events with built-in and custom sound upload support (truncated).",
  "frontend/src/config/lockScreenConfig.ts": "Exports function to retrieve lock screen password, defaulting to 'swh1400' or using VITE_LOCK_PASSWORD environment variable if set.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor instance for backend communication, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout with AuthClient, managing identity state and login status (truncated).",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting print jobs, fetching print history, and increasing print counts, with backend availability tracking and IC error handling.",
  "frontend/src/hooks/useWakeLock.ts": "React hook that manages the Wake Lock API to prevent screen dimming, with support for persistence via localStorage and automatic re-acquisition when the page becomes visible.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for a dark warehouse theme with blue accents, including touch-friendly sizing (44px minimum) and focus states for accessibility.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/printing/barcodePreview.ts": "Generates deterministic barcode SVG patterns from serial data by creating alternating black/white bars based on character codes, with fallback error handling.",
  "frontend/src/printing/cpclBarcodeDiagnostics.ts": "Provides validation and diagnostic logging utilities for CPCL barcode generation, checking for empty data, whitespace, control characters, positioning issues, and height calculations.",
  "frontend/src/printing/cpclBarcodeMapping.ts": "Maps UI barcode types (CODE128, EAN13, etc.) to CPCL printer tokens with recommended width/ratio parameters, providing fallback to CODE128 for unsupported types.",
  "frontend/src/printing/cpclGenerator.ts": "Generates CPCL printer command strings for labels, test prints, and calibration patterns, with validation, clamping, and diagnostic logging for barcode positioning and scaling.",
  "frontend/src/printing/cpclLayoutAdjustments.ts": "Provides utilities to clamp barcode X positions within label boundaries to prevent clipping, and estimates CODE128 barcode widths in dots based on data length and CPCL parameters.",
  "frontend/src/printing/LabelPreview.tsx": "React component that renders a visual preview of label layouts with zoom controls, sample serial inputs, and barcode rendering using SVG, applying calibration offsets and CPCL layout adjustments.",
  "frontend/src/printing/previewUnits.ts": "Defines unit conversion constants and functions for translating between millimeters, printer dots (203 DPI), and CSS pixels for preview rendering.",
  "frontend/src/screens/LockScreen.tsx": "Renders a password entry screen that unlocks the application using the PasswordSessionProvider, with error handling and auto-focus on the input field.",
  "frontend/src/screens/PasswordSessionWiringErrorScreen.tsx": "Displays an error screen when the password session system is misconfigured, offering troubleshooting steps and a page refresh button.",
  "frontend/src/services/printerService.ts": "Zustand store managing USB printer connection state, CPCL transmission via WebUSB, and test print functionality with logging integration.",
  "frontend/src/services/usbCpclTransport.ts": "WebUSB transport layer providing device discovery, connection management, and bulk data transfer for CPCL-compatible USB label printers.",
  "frontend/src/state/backendAvailabilityStore.ts": "Zustand store tracking backend availability status with timestamps for last success/error and actions to mark the backend as stopped or available.",
  "frontend/src/state/diagnosticsStore.ts": "Persisted Zustand store tracking scan/print/error counts globally and per label type, with increment actions for diagnostics reporting.",
  "frontend/src/state/labelSettingsStore.ts": "Zustand store for label settings with BigInt serialization, localStorage persistence, and migration logic. Manages layout settings for title, barcodes, serial text, calibration offsets, and prefix-to-label-type mappings with default values for 48x30mm labels.",
  "frontend/src/state/logStore.ts": "Zustand store for system logs with persistence, storing up to 1000 log entries with timestamp, level (info/warn/error), message, and optional metadata. Exports addLog function and useLogs hook.",
  "frontend/src/state/printHistoryStore.ts": "Zustand store for print history with persistence, storing up to 1000 entries with timestamp, serials, label type, and CPCL. Provides reprint functionality via usePrintHistory hook.",
  "frontend/src/state/useLabelSettingsHydration.ts": "React hook that tracks whether the label settings store has finished hydrating from localStorage, distinguishing between 'not yet loaded' and 'loaded with defaults' states.",
  "frontend/src/tabs/DevicesTab.tsx": "React component for printer device management, providing USB connection controls, connection status display, test print functionality, and WebUSB support detection with appropriate warnings.",
  "frontend/src/tabs/DiagnosticsTab.tsx": "React component with three tabs (Stats, History, Logs) displaying diagnostics counters, print history with reprint functionality, and filterable system logs.",
  "frontend/src/tabs/LabelSettingsTab.tsx": "React component for configuring label dimensions, barcode settings, layout positions, calibration offsets, prefix mappings, custom label types, and sound effects. Includes import/export, preview, test print, and calibration pattern printing.",
  "frontend/src/tabs/ScanPrintTab.tsx": "React component for two-step serial scanning workflow with validation, prefix detection, automatic label type mapping, CPCL generation, printer submission, backend job submission, and comprehensive error handling with sound feedback.",
  "frontend/src/utils/barcodeSettingsValidation.ts": "Validates barcode and layout settings for CPCL printers, checking supported barcode types (CODE128, CODE39, EAN13, etc.) and ensuring barcode dimensions, scales, and computed heights are valid for printing at 203 DPI.",
  "frontend/src/utils/icErrors.ts": "Detects and formats Internet Computer canister errors, specifically IC0508 'canister is stopped' errors, and provides user-friendly messages indicating local printing can continue when the backend is unavailable.",
  "frontend/src/utils/labelSettingsErrors.ts": "Parses label settings update errors into user-friendly messages, handling authorization failures, network errors, duplicate serials, and canister stopped conditions with actionable guidance.",
  "frontend/src/utils/labelSettingsImportExport.ts": "Handles import/export of label settings with BigInt serialization, migrates old settings structures to new layout-based format, and validates imported settings including barcode configuration and prefix mappings.",
  "frontend/src/utils/labelTypes.ts": "Defines built-in label types (Dual Band, Tri Band, New Dual Band), extracts custom types from prefix mappings, and provides utilities for displaying and sorting all available label types.",
  "frontend/src/utils/scanPrintErrors.ts": "Formats scan-and-print errors (backend submission, printer communication, USB/Bluetooth) into concise user-facing messages and identifies non-blocking backend errors where local printing can continue.",
  "frontend/src/utils/serialNormalization.ts": "Normalizes scanned serial numbers by trimming whitespace and removing common barcode scanner suffix characters (CR, LF, Tab).",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from both query strings and hash-based routing, persisting parameters in sessionStorage, and clearing sensitive parameters from the URL without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including container, border radius, shadows, and accordion animations, with typography, container queries, and animate plugins.",
  "project_state.json": "Project state metadata for a label printing app using CPCL protocol, documenting a known issue where barcodes don't fit on printed labels despite correct preview positioning, with four existing features addressing barcode generation, positioning calibration, width estimation, and preview accuracy."
}