{
  "backend/main.mo": "Motoko backend defining label, user, and print job types with access control, user profiles, print job submission, and serial duplication checks.",
  "feature_evidence.json": "Feature evidence report mapping two logo‑related frontend features to AppShell.tsx with metadata and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend source file paths to concise descriptions of each file’s purpose.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and applying global background/foreground styles.",
  "frontend/index.html": "Root HTML file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Wraps the app in ErrorBoundary and PasswordSessionProvider and routes between LockScreen and AppShell based on session state.",
  "frontend/src/audio/soundSystem.ts": "Zustand‑based sound settings store with Web Audio beeps for success, error, and print completion events.",
  "frontend/src/auth/passwordSession.ts": "LocalStorage password session utilities handling create/get/clear plus validation and expiry checks.",
  "frontend/src/auth/PasswordSessionProvider.tsx": "React context managing password sessions with unlock, lock, and auto‑rehydration logic.",
  "frontend/src/components/AppShell.tsx": "Defines the main application layout with header controls, tabbed navigation, and footer.",
  "frontend/src/components/BackendAvailabilityIndicator.tsx": "Shows a destructive badge when the backend is unavailable based on store state.",
  "frontend/src/components/ErrorBoundary.tsx": "A React error boundary that displays a fallback UI or default error screen on runtime errors.",
  "frontend/src/components/HeaderDeviceControls.tsx": "Displays printer connection status and a wake‑lock toggle using related hooks.",
  "frontend/src/components/SerialTypeCounters.tsx": "Renders print counters for label type prefixes with loading and empty states.",
  "frontend/src/config/lockScreenConfig.ts": "Provides lock‑screen password retrieval, allowing build‑time override via environment variable.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context with login, logout, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for submitting print jobs, fetching history, and increasing print counts with backend availability checks.",
  "frontend/src/hooks/useWakeLock.ts": "Manages screen wake‑lock support, activation, persistence, and visibility‑based re‑acquisition.",
  "frontend/src/index.css": "Tailwind base stylesheet defining theme variables, dark mode, accessibility styles, and form/button sizing.",
  "frontend/src/main.tsx": "Bootstraps the app with React, Internet Identity provider, React Query client, and global styles.",
  "frontend/src/printing/barcodePreview.ts": "Generates a deterministic SVG barcode from input data by constructing a simple bar pattern without external libraries.",
  "frontend/src/printing/cpclGenerator.ts": "Builds CPCL command strings for test prints and full labels using layout settings, DPI conversions, and serial data.",
  "frontend/src/printing/LabelPreview.tsx": "React component that renders a live label preview with zoom controls and sample serial inputs, converting layout settings into pixel-based positions.",
  "frontend/src/screens/LockScreen.tsx": "Password entry screen that handles unlock attempts with validation, loading state, and automatic input focusing.",
  "frontend/src/screens/PasswordSessionWiringErrorScreen.tsx": "Displays a configuration error message with troubleshooting steps and a page refresh button.",
  "frontend/src/services/printerService.ts": "Zustand store managing printer connections, USB integration, CPCL sending, and test print generation.",
  "frontend/src/services/usbCpclTransport.ts": "WebUSB-based utilities for detecting, connecting, and communicating with USB CPCL printers.",
  "frontend/src/state/backendAvailabilityStore.ts": "Zustand store tracking backend availability with timestamps and functions to mark errors or recovery.",
  "frontend/src/state/diagnosticsStore.ts": "Zustand store tracking total scans, prints, errors, and per-type counters with increment helpers and persistence.",
  "frontend/src/state/labelSettingsStore.ts": "Zustand store for label settings with BigInt‑safe persistence, default layouts, and migration from older formats.",
  "frontend/src/state/logStore.ts": "Persistent log store that records timestamped info/warn/error messages, keeping the latest 500 entries.",
  "frontend/src/state/printHistoryStore.ts": "Persistent print history store with up to 1000 entries and a reprint helper using the printer service and log updates.",
  "frontend/src/tabs/DevicesTab.tsx": "UI for connecting to a printer via Bluetooth or USB, showing connection status and allowing test prints.",
  "frontend/src/tabs/DiagnosticsTab.tsx": "Diagnostics UI showing scan/print stats, history, logs, sound settings, and reprint actions.",
  "frontend/src/tabs/LabelSettingsTab.tsx": "Editor UI for label layout and mapping settings with import/export, preview, and validation features.",
  "frontend/src/tabs/ScanPrintTab.tsx": "React component handling two-step serial scanning, prefix detection, validation, and print job submission with printer integration.",
  "frontend/src/utils/icErrors.ts": "Utility for detecting IC canister-stopped errors and providing user-friendly error messages.",
  "frontend/src/utils/labelSettingsErrors.ts": "Parses backend errors for label settings updates and maps them to readable user-facing messages.",
  "frontend/src/utils/labelSettingsImportExport.ts": "Handles export/import of label settings, including BigInt-safe serialization and migration from old formats.",
  "frontend/src/utils/labelTypes.ts": "Defines built‑in and custom label types and provides utilities for extracting and naming them.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and removing URL parameters using query strings, hash routing, and session storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, layout, plugins, and custom animations.",
  "project_state.json": "JSON document describing the project’s current build state, architectural notes, known issues, and feature list for an Android-based barcode/label printing system. Includes platform details, workflows, diagnostics, and problems to resolve in future development."
}