{
  "backend/main.mo": "Motoko canister handling user profiles, access control, label settings, and print job submission with serial-duplication checks and per‑user mappings.",
  "feature_evidence.json": "Feature evidence report listing affected frontend files, components, and test IDs for two Scan & Print workflow improvements.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to concise summaries describing each module's purpose and functionality.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme CSS variables and applying base styles.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Root React component wiring password session handling, error boundaries, and conditional rendering of LockScreen or AppShell.",
  "frontend/src/audio/soundSystem.ts": "Zustand-backed sound settings store with Web Audio API beep generation and helpers for playing success, error, and print-complete sounds.",
  "frontend/src/auth/passwordSession.ts": "LocalStorage-backed password session utilities handling creation, validation, expiry, and password checking.",
  "frontend/src/auth/PasswordSessionProvider.tsx": "React context managing password session lifecycle with unlock/lock functions and session rehydration.",
  "frontend/src/components/AppShell.tsx": "Main layout component providing header, tab navigation, and page structure for scan, settings, devices, and diagnostics tabs.",
  "frontend/src/components/BackendAvailabilityIndicator.tsx": "Displays a warning badge when the backend is unavailable using state from backendAvailabilityStore.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches runtime errors and renders a fallback UI with a refresh option.",
  "frontend/src/components/HeaderDeviceControls.tsx": "Shows printer connection status and a wake-lock toggle using printerService and useWakeLock.",
  "frontend/src/components/SerialTypeCounters.tsx": "Renders print counters per label type based on diagnostics and label settings, with loading and empty states.",
  "frontend/src/config/lockScreenConfig.ts": "Provides the expected lock-screen password, allowing build-time override via VITE_LOCK_PASSWORD.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for authentication, login, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Custom hooks for print job mutations and history queries with backend availability handling.",
  "frontend/src/hooks/useWakeLock.ts": "Manages screen wake lock state with persistence and automatic re-request on visibility changes.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, dark mode, and accessibility-focused UI rules.",
  "frontend/src/main.tsx": "App entry point wiring React, Internet Identity provider, React Query client, and global styles.",
  "frontend/src/printing/barcodePreview.ts": "Creates simple deterministic barcode SVGs by converting input text into patterned bar widths.",
  "frontend/src/printing/cpclGenerator.ts": "Builds CPCL command strings for test prints and dynamic labels using layout settings and serial numbers.",
  "frontend/src/printing/LabelPreview.tsx": "Renders an interactive preview of a label layout with zoom controls and sample serial inputs, generating barcode SVGs based on settings.",
  "frontend/src/screens/LockScreen.tsx": "Displays a password entry screen that unlocks the app and handles validation, focus, and error feedback.",
  "frontend/src/screens/PasswordSessionWiringErrorScreen.tsx": "Shows a configuration error message with troubleshooting steps and a refresh button.",
  "frontend/src/services/printerService.ts": "Manages printer connection state and sending CPCL data over USB or simulated Bluetooth via a Zustand store.",
  "frontend/src/services/usbCpclTransport.ts": "Implements WebUSB-based printer discovery, connection, and data transfer for CPCL printers.",
  "frontend/src/state/backendAvailabilityStore.ts": "Zustand store tracking backend availability with timestamps and error state management.",
  "frontend/src/state/diagnosticsStore.ts": "Zustand store tracking scans, prints, errors, and per-type counters with persistent storage and helper increment functions.",
  "frontend/src/state/labelSettingsStore.ts": "Persistent Zustand store for label settings with BigInt-safe storage, default layouts, and migration from old formats.",
  "frontend/src/state/logStore.ts": "Persistent log store storing up to 500 timestamped log entries with simple add-log functionality.",
  "frontend/src/state/printHistoryStore.ts": "Persistent print history store keeping the last 1000 print entries and providing a reprint helper using the printer service.",
  "frontend/src/tabs/DevicesTab.tsx": "UI for connecting to a printer via Bluetooth or USB, showing connection status and providing a test print option.",
  "frontend/src/tabs/DiagnosticsTab.tsx": "Diagnostics UI showing scan/print stats, history with reprint, logs with filtering, and sound settings controls.",
  "frontend/src/tabs/LabelSettingsTab.tsx": "UI for editing, importing, exporting, and previewing label layout settings with support for prefix mappings and custom types.",
  "frontend/src/tabs/ScanPrintTab.tsx": "React tab handling two-step serial scanning, prefix detection, validation, and print job submission with printer and state integrations.",
  "frontend/src/utils/icErrors.ts": "Utilities to detect IC canister-stopped errors and return a user-friendly message.",
  "frontend/src/utils/labelSettingsErrors.ts": "Parses errors from label settings updates and maps them to clear user-facing messages.",
  "frontend/src/utils/labelSettingsImportExport.ts": "Handles exporting label settings with BigInt support and importing/migrating old or new settings formats with validation.",
  "frontend/src/utils/labelTypes.ts": "Defines built‑in and custom label types and utilities for naming, extraction, and aggregation.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, layout, animations, and plugin setup.",
  "project_state.json": "Defines the project’s current build state, including high‑level goals, architecture notes, known issues, and existing features for an Android tablet barcode/label printing app using React/TypeScript and a Motoko backend."
}