{
  "kind": "build_request",
  "title": "Add app logo in header next to app title",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-57",
      "text": "Add the user-provided logo image to the AppShell header in the top-left, positioned immediately next to the app title text (“Make Some Double!!”). The logo must be left-aligned with the title, vertically centered, and sized appropriately for a tablet header without pushing the existing top-right controls (backend indicator, device controls, lock button) off-screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "add dthis as app logo in top left corner next too app title"
        ]
      },
      "acceptanceCriteria": [
        "Header shows a logo image to the left of the “Make Some Double!!” title text.",
        "Logo and title are grouped together on the left side of the header; existing right-side controls remain on the right and remain visible.",
        "Logo is visually aligned (vertically centered) with the title and has consistent spacing between logo and title.",
        "Logo has appropriate accessibility attributes (e.g., non-empty alt text in English such as \"Make Some Double\" or \"App logo\").",
        "No changes are made to any immutable frontend paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-58",
      "text": "Add the provided logo image as a static frontend asset under frontend/public/assets/generated and reference it from the header logo element (do not load it via the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "add dthis as app logo in top left corner next too app title"
        ]
      },
      "acceptanceCriteria": [
        "A logo file exists under frontend/public/assets/generated and is used by the header logo <img> (or equivalent) via a static path.",
        "The app renders the logo correctly after a full hard refresh (asset served as part of the frontend build)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not add any backend dependency for serving or transforming the logo image (static asset only).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Changing the app title text.",
    "Changing tab layout, scan/print behavior, label settings behavior, or any backend functionality.",
    "Implementing theme changes beyond what is necessary to place and size the logo cleanly in the existing header."
  ],
  "imageRequirements": {
    "required": [
      "App logo from the uploaded image, cropped/converted for web use (app-logo.dim_256x256.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}