{
  "kind": "build_request",
  "title": "Fix barcode alignment to match preview in CPCL printouts",
  "projectName": "Label Printer",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Adjust CPCL barcode generation parameters in cpclGenerator.ts to ensure barcodes fit completely within the label boundaries when printed using CPCL protocol",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Why my label print out doesn't look like preview? Barcode still is not fully on label.",
          "remember label is printed out using cpcl protocol"
        ]
      },
      "acceptanceCriteria": [
        "Barcodes are fully visible on printed labels without any clipping at edges",
        "Both upper and lower barcodes fit completely within the label boundaries"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Calibrate barcode positioning calculations in cpclLayoutAdjustments.ts to account for CPCL printer coordinate system and ensure printout matches the preview shown in the uploaded photo",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Adjust to make print out exactly how is on preview showed on photo",
          "Make that finally work"
        ]
      },
      "acceptanceCriteria": [
        "Printed label layout matches the preview display pixel-for-pixel",
        "Barcode horizontal positioning on printout matches preview positioning",
        "Text and barcode vertical spacing matches preview"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Review and adjust barcode width estimation logic for CODE128 barcodes in cpclLayoutAdjustments.ts to accurately calculate barcode dimensions for CPCL protocol output",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Barcode still is not fully on label",
          "Adjust settings"
        ]
      },
      "acceptanceCriteria": [
        "Barcode width calculations accurately reflect actual printed dimensions",
        "Center alignment calculations use correct barcode width values",
        "No barcode overflow beyond label edges"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update LabelPreview.tsx to accurately represent CPCL printer output so the preview matches actual printed results with correct scaling and positioning",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Why my label print out doesn't look like preview?",
          "make print out exactly how is on preview"
        ]
      },
      "acceptanceCriteria": [
        "Preview display accurately represents what will be printed via CPCL",
        "Barcode dimensions in preview match printed barcode dimensions",
        "Element positioning in preview matches physical printout positions"
      ]
    }
  ],
  "constraints": [
    "All changes must maintain CPCL protocol compatibility",
    "Do not modify the backend/main.mo file",
    "Do not alter the USB printer communication layer in usbCpclTransport.ts",
    "Preserve existing calibration offset functionality"
  ],
  "nonGoals": [
    "Changing the barcode symbology type",
    "Adding new label types or templates",
    "Modifying the scanning workflow",
    "Altering printer connection logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}