{
  "kind": "build_request",
  "title": "Add 'Print test label' button in Label Settings preview to print exactly what is shown",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Label Settings tab, add a user-visible action next to the Label Preview that prints a test label matching the current preview (including the current sample serial inputs and the preview title). Use English for the button label and any related UI text (e.g., \"Print test label\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I label setting next to label preview add option to print test label whatever showing on preview so when I adjust the settings i can do test print."
        ]
      },
      "acceptanceCriteria": [
        "Label Settings > Label Preview area contains a \"Print test label\" action placed adjacent to the preview (e.g., in the preview card header/actions).",
        "Clicking \"Print test label\" sends a print job to the currently connected printer using the current in-tab label settings and the exact values currently shown in the preview (sample serial 1, sample serial 2, and the title displayed in the preview).",
        "If no printer is connected, clicking the action does not crash and instead shows a clear error toast (English) explaining that a printer must be connected (and that the user can connect it in the Devices tab).",
        "While the test label is being sent, the UI indicates progress (e.g., disables the button and shows a \"Printing…\" label) and re-enables after completion/failure."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Refactor the Label Preview component so the parent (LabelSettingsTab) can access the exact preview data currently being displayed (at minimum: sample serial 1, sample serial 2, and the computed preview title), so the new \"Print test label\" action can print exactly what is shown.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "print test label whatever showing on preview"
        ]
      },
      "acceptanceCriteria": [
        "LabelPreview no longer keeps the preview-critical values exclusively internal; LabelSettingsTab can read the current sample serial values and the title shown in the preview at the moment the user clicks \"Print test label\".",
        "Changing sample serial inputs in the preview updates the values used for \"Print test label\" without requiring a page refresh.",
        "The preview rendering behavior remains unchanged (zoom controls, layout, and sample serial inputs still work)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add/adjust CPCL generation support so printing from the Label Settings preview does not depend on prefix mappings to determine the printed title; it must be able to print with an explicit title matching the preview title.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "whatever showing on preview"
        ]
      },
      "acceptanceCriteria": [
        "The CPCL used by \"Print test label\" uses the same layout settings as the preview and includes the same title text shown in the preview, even when prefix mappings are empty or do not match a prefix.",
        "The implementation does not break existing print flows that use the current CPCL generator (e.g., Scan & Print, Devices tab test print)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not modify files listed in frontend.immutablePaths in SYSTEM_CONTEXT.",
    "Keep backend architecture unchanged (single Motoko actor); this feature should be implemented entirely on the frontend unless a backend change is strictly required."
  ],
  "nonGoals": [
    "Do not add new printer connection methods (Bluetooth, network, etc.).",
    "Do not change the Scan & Print workflow or backend print-job submission behavior.",
    "Do not redesign the overall Label Settings page beyond adding the requested test-print option near the preview."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}