{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix barcode alignment to match preview in CPCL printouts",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Adjust CPCL barcode generation parameters to ensure barcodes fit completely within label boundaries",
      "acceptanceCriteria": [
        "Barcodes are fully visible on printed labels without any clipping at edges",
        "Both upper and lower barcodes fit completely within the label boundaries"
      ],
      "file_operations": [
        {
          "path": "frontend/src/printing/cpclGenerator.ts",
          "operation": "modify",
          "description": "Review and adjust barcode generation parameters including barcode height calculation, scale clamping logic, and CPCL command string construction. Ensure barcode dimensions account for CPCL printer coordinate system and margins to prevent edge clipping. Verify barcode height does not exceed available vertical space after accounting for text elements and spacing. Add defensive bounds checking before generating CPCL BARCODE commands."
        },
        {
          "path": "frontend/src/printing/cpclLayoutAdjustments.ts",
          "operation": "modify",
          "description": "Refine barcode positioning and clamping utilities to ensure barcodes remain fully within label boundaries. Review and adjust the CODE128 barcode width estimation logic to accurately reflect actual printed dimensions for center alignment calculations. Update clampBarcodePosition to account for true barcode width including quiet zones. Ensure horizontal positioning calculations prevent any barcode overflow beyond label edges."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Calibrate barcode positioning calculations to match CPCL printer coordinate system and ensure printout matches preview",
      "acceptanceCriteria": [
        "Printed label layout matches the preview display pixel-for-pixel",
        "Barcode horizontal positioning on printout matches preview positioning",
        "Text and barcode vertical spacing matches preview"
      ],
      "file_operations": [
        {
          "path": "frontend/src/printing/cpclLayoutAdjustments.ts",
          "operation": "modify",
          "description": "Calibrate coordinate transformations between logical layout coordinates and CPCL printer dots. Review centerAlignBarcode function to ensure it accurately calculates barcode center positions accounting for CPCL's coordinate origin and any printer-specific offsets. Adjust positioning logic to match the preview's visual layout when translated to CPCL commands. Verify calibration offset application is consistent between preview and print generation."
        },
        {
          "path": "frontend/src/printing/cpclGenerator.ts",
          "operation": "modify",
          "description": "Ensure CPCL command generation applies the same coordinate transformations and calibration offsets used in the preview rendering. Verify that barcode and text positioning in the generated CPCL string matches the calculated positions used by LabelPreview. Add validation to ensure vertical spacing between elements (title, barcodes, serial text) is preserved in the CPCL output."
        },
        {
          "path": "frontend/src/printing/LabelPreview.tsx",
          "operation": "modify",
          "description": "Review preview coordinate transformations to ensure they accurately represent the CPCL printer's coordinate system. Verify that calibration offsets and center-aligned barcode positioning adjustments in the preview match those applied in cpclGenerator. Ensure the preview's SVG barcode dimensions and positions reflect the actual printed output by using the same width estimation and positioning calculations."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Review and adjust barcode width estimation logic for CODE128 barcodes to accurately calculate dimensions for CPCL output",
      "acceptanceCriteria": [
        "Barcode width calculations accurately reflect actual printed dimensions",
        "Center alignment calculations use correct barcode width values",
        "No barcode overflow beyond label edges"
      ],
      "file_operations": [
        {
          "path": "frontend/src/printing/cpclLayoutAdjustments.ts",
          "operation": "modify",
          "description": "Review the estimateCode128BarcodeWidth function to ensure it accurately models the actual printed barcode width for CODE128 symbology in CPCL. Verify the calculation accounts for start/stop characters, check digits, narrow/wide bar ratios, and the configured scale factor. Cross-reference against CPCL barcode width behavior and adjust the estimation formula if needed. Update clamping logic to use the corrected width estimation to prevent barcodes from exceeding label boundaries."
        },
        {
          "path": "frontend/src/printing/cpclBarcodeMapping.ts",
          "operation": "modify",
          "description": "Review the CODE128 barcode mapping parameters (width, ratio) to ensure they align with CPCL printer behavior and the width estimation logic in cpclLayoutAdjustments. Verify that the recommended parameters produce barcodes that match the estimated dimensions. Adjust parameters if discrepancies are found between estimated and actual printed widths."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update LabelPreview to accurately represent CPCL printer output with correct scaling and positioning",
      "acceptanceCriteria": [
        "Preview display accurately represents what will be printed via CPCL",
        "Barcode dimensions in preview match printed barcode dimensions",
        "Element positioning in preview matches physical printout positions"
      ],
      "file_operations": [
        {
          "path": "frontend/src/printing/LabelPreview.tsx",
          "operation": "modify",
          "description": "Update the preview rendering to use the same barcode width estimation logic from cpclLayoutAdjustments for sizing the SVG barcode elements. Ensure barcode and text positioning in the preview applies the same coordinate transformations, calibration offsets, and center-alignment adjustments used in cpclGenerator. Verify that the preview's scale factor and unit conversions match the CPCL printer's 203 DPI output. Add visual debugging aids if needed to compare preview vs. printed layout."
        },
        {
          "path": "frontend/src/printing/previewUnits.ts",
          "operation": "modify",
          "description": "Review and verify that unit conversion functions (millimeters to printer dots, dots to CSS pixels) accurately represent the CPCL printer's 203 DPI resolution. Ensure the conversion constants match the actual printer behavior and that the preview scaling faithfully reproduces printed dimensions. Adjust conversion factors if discrepancies are found between preview and physical printout measurements."
        },
        {
          "path": "frontend/src/printing/barcodePreview.ts",
          "operation": "modify",
          "description": "Review the SVG barcode generation logic to ensure the deterministic bar pattern widths and spacing match the actual CODE128 barcode dimensions produced by the CPCL printer. Verify that the preview barcode's visual width corresponds to the estimated width used in layout calculations. Adjust bar widths or quiet zones if the preview does not visually match the printed barcode size."
        }
      ]
    }
  ]
}