{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Label Settings: print test label matching the live preview",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a \"Print test label\" action beside the Label Preview that prints exactly what the preview currently shows, with progress and error handling when no printer is connected.",
      "acceptanceCriteria": [
        "Label Settings > Label Preview area contains a \"Print test label\" action placed adjacent to the preview (e.g., in the preview card header/actions).",
        "Clicking \"Print test label\" sends a print job to the currently connected printer using the current in-tab label settings and the exact values currently shown in the preview (sample serial 1, sample serial 2, and the title displayed in the preview).",
        "If no printer is connected, clicking the action does not crash and instead shows a clear error toast (English) explaining that a printer must be connected (and that the user can connect it in the Devices tab).",
        "While the test label is being sent, the UI indicates progress (e.g., disables the button and shows a \"Printing…\" label) and re-enables after completion/failure."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/LabelSettingsTab.tsx",
          "operation": "modify",
          "description": "Add a \"Print test label\" button in the Label Preview card header/actions. Wire it to the existing printer connection state (usePrinterService) to (1) guard when no printer is connected by showing an English sonner toast directing users to the Devices tab, (2) send CPCL built from the current in-tab preview settings + current preview serial/title, and (3) show progress (disable button + label \"Printing…\") with success/failure toasts."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Refactor LabelPreview so LabelSettingsTab can read the exact preview values (sample serials and computed title) at print time without changing preview behavior.",
      "acceptanceCriteria": [
        "LabelPreview no longer keeps the preview-critical values exclusively internal; LabelSettingsTab can read the current sample serial values and the title shown in the preview at the moment the user clicks \"Print test label\".",
        "Changing sample serial inputs in the preview updates the values used for \"Print test label\" without requiring a page refresh.",
        "The preview rendering behavior remains unchanged (zoom controls, layout, and sample serial inputs still work)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/printing/LabelPreview.tsx",
          "operation": "modify",
          "description": "Refactor LabelPreview to accept controlled props (sampleSerial1, sampleSerial2, and previewTitle) and change handlers (onSampleSerial1Change/onSampleSerial2Change) so the parent can always access the exact displayed values, while preserving existing zoom controls and rendering."
        },
        {
          "path": "frontend/src/tabs/LabelSettingsTab.tsx",
          "operation": "modify",
          "description": "Lift preview-critical state (sampleSerial1, sampleSerial2, and the computed preview title) into LabelSettingsTab, pass them into LabelPreview as controlled props, and ensure the preview uses the same in-tab (possibly unsaved) label settings object that will be used for printing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Adjust CPCL generation so the Label Settings preview test print can print with an explicit title that matches the preview title, without breaking existing print flows.",
      "acceptanceCriteria": [
        "The CPCL used by \"Print test label\" uses the same layout settings as the preview and includes the same title text shown in the preview, even when prefix mappings are empty or do not match a prefix.",
        "The implementation does not break existing print flows that use the current CPCL generator (e.g., Scan & Print, Devices tab test print)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/printing/cpclGenerator.ts",
          "operation": "modify",
          "description": "Add CPCL generation support for an explicit title (e.g., a new exported function dedicated to preview printing, or an optional parameter) that bypasses prefix-mapping title lookup when provided, while keeping the existing generateCPCL call signature/behavior for current flows intact."
        },
        {
          "path": "frontend/src/tabs/LabelSettingsTab.tsx",
          "operation": "modify",
          "description": "Update the new \"Print test label\" action to call the explicit-title CPCL generator so printing matches the preview title even when prefix mappings are empty or do not match."
        }
      ]
    }
  ]
}