{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Offline-first Scan & Print: print without backend + improved backend-unavailable UX",
  "requirements": [
    {
      "id": "REQ-71",
      "summary": "Make Scan & Print auto-print succeed locally (generate CPCL + send to printer) even when the backend is unavailable, while still recording local diagnostics and history.",
      "acceptanceCriteria": [
        "When the backend canister is stopped/unavailable, scanning 1st serial (valid prefix) and scanning 2nd serial (matching type) still generates CPCL and sends it to the printer transport successfully.",
        "A backend failure must not flip the 2nd serial field from success to error if the print send succeeds.",
        "Print success must still update local diagnostics counters and local print history, including CPCL payload, even when backend calls fail."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/ScanPrintTab.tsx",
          "operation": "modify",
          "description": "Refactor the 2nd-scan auto-print flow to be offline-first: validate scans, generate CPCL from local Label Settings, send CPCL via printerService, then always persist local print history (including CPCL) and increment local diagnostics on successful send regardless of backend availability. Move backend submission to a best-effort follow-up that cannot change the success state once printing succeeds."
        },
        {
          "path": "frontend/src/utils/scanPrintErrors.ts",
          "operation": "create",
          "description": "Add Scan & Print–specific error/notice formatting helpers to convert printer/transport/backend errors into concise user-facing strings (no raw replica rejection blobs), including a dedicated message for IC0508/canister-stopped that states printing can continue locally when a printer is connected."
        }
      ]
    },
    {
      "id": "REQ-72",
      "summary": "Harden the printing sequence so printer-send success is authoritative; backend submission failures become non-blocking warnings without disrupting scan/print behavior.",
      "acceptanceCriteria": [
        "If CPCL sending fails, the UI shows a print failure error state and does not reset the form.",
        "If CPCL sending succeeds but backend submission fails, the UI still shows print complete behavior (success state, reset) and the failure is recorded only as a warning/info log (not as the main destructive error banner).",
        "The app must remain scanner-only friendly: no modal dialogs required to dismiss before scanning the next label."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/ScanPrintTab.tsx",
          "operation": "modify",
          "description": "Reorder and harden the sequence to (1) validate scans, (2) generate CPCL, (3) send CPCL, (4) trigger backend submission as non-blocking best-effort. Ensure sendCPCL failure keeps the form in-place for retry (no reset) and sets an error state; ensure backend submission failure only adds a small non-blocking notice + warn/info log and never sets destructive error state after a successful send."
        },
        {
          "path": "frontend/src/state/logStore.ts",
          "operation": "modify",
          "description": "Ensure Scan & Print can record backend-submission failures as warn/info entries (not error) with concise messages suitable for diagnostics review; keep existing persistence and caps unchanged."
        }
      ]
    },
    {
      "id": "REQ-73",
      "summary": "Replace raw replica rejection details with concise English messaging for backend-unavailable scenarios in Scan & Print.",
      "acceptanceCriteria": [
        "When an IC0508-style error occurs during any Scan & Print backend call, the user-facing error/notice text is concise and readable (no request IDs, reject code dumps, or embedded JSON).",
        "The existing header backend availability badge may still appear, but Scan & Print must not show the full replica error blob in its main alert area."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/icErrors.ts",
          "operation": "modify",
          "description": "Update IC0508/canister-stopped messaging to be Scan & Print–appropriate (backend unavailable, printing can continue locally if printer is connected) and add/adjust helpers to reliably detect and summarize IC replica rejection errors without exposing raw rejection JSON in UI."
        },
        {
          "path": "frontend/src/tabs/ScanPrintTab.tsx",
          "operation": "modify",
          "description": "Replace any direct rendering of caught backend error.message with formatted, concise text from the error helper(s). Introduce a non-blocking notice area for backend submission issues so the main destructive alert is reserved for scan validation or printer-send failures only."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure backend submission failures surfaced to callers are suitable for non-blocking handling (e.g., provide a concise error message for logging/notice) while preserving existing backend availability store updates; avoid exposing raw replica rejection blobs as the primary error string used by Scan & Print."
        }
      ]
    }
  ]
}